{
  "schema_version": "1.3.0",
  "id": "OSV-SA-CONTRIB-2020-012",
  "modified": "2023-08-12T05:56:01.000Z",
  "published": "2020-05-07T04:47:19.000Z",
  "aliases": [],
  "related": [],
  "summary": "",
  "details": "<p>This module enables you to build forms and surveys in Drupal.</p>\n<p>The module doesn't sufficiently validate data submitted into Webform Signature element during webform submission creation. This allows a malicious user to generate and extract HMAC hashes for arbitrary data. Such HMAC hashes are used across multiple spots in Drupal 8 core and contrib modules.</p>\n<p>An extracted HMAC hash could be used to view restricted site content or log in as another user in certain situations.</p>\n<p>This vulnerability is mitigated by the fact that an attacker must be able to create a webform submission with \"Signature\" element and then be able to view the submission.</p>\n<p>For Drupal instances that have \"Signature\" webform element available to users with low trust, it is advised to change the value of the hash salt within <code class=\"language-php\">settings.php</code> file to a new random value. Below we reference the specific extract from <code class=\"language-php\">settings.php</code> that is advised for change in such Drupal instances:</p>\n<p></p><pre class=\"codeblock\"><code class=\"language-php\">/**\n * Salt for one-time login links, cancel links, form tokens, etc.\n *\n * This variable will be set to a random value by the installer. All one-time\n * login links will be invalidated if the value is changed. Note that if your\n * site is deployed on a cluster of web servers, you must ensure that this\n * variable has the same value on each server.\n *\n * For enhanced security, you may set this variable to the contents of a file\n * outside your document root; you should also ensure that this file is not\n * stored with backups of your database.\n *\n * Example:\n * @code\n *   $settings['hash_salt'] = file_get_contents('/home/example/salt.txt');\n * @endcode\n */\n$settings['hash_salt'] = 'new-value-here';\n</code></pre>\n",
  "affected": [
    {
      "package": {
        "ecosystem": "Packagist",
        "name": "drupal/webform"
      },
      "severity": [],
      "ranges": [
        {
          "type": "ECOSYSTEM",
          "events": [
            {
              "introduced": "0"
            },
            {
              "fixed": "5.11.0"
            }
          ]
        }
      ]
    }
  ],
  "references": [
    {
      "type": "WEB",
      "url": "https://www.drupal.org/sa-contrib-2020-012"
    }
  ],
  "credits": [
    {
      "name": "Heine ",
      "contact": [
        "https://www.drupal.org/user/17943"
      ]
    }
  ]
}